var initials = {
	"a": {
		RES: "あ"
	},
	"e": {
		RES: "え"
	},
	"i": {
		RES: "い"
	},
	"o": {
		RES: "お"
	},
	"u": {
		RES: "う"
	},
	"w": {
		RES: "っ",
		"a": {
			RES: "わ"
		},
		"o": {
			RES: "を"
		}
	},
	"f": {
		RES: "っ",
		"a": {
			RES: "ふぁ"
		},
		"e": {
			RES: "ふぇ"
		},
		"i": {
			RES: "ふぃ"
		},
		"o": {
			RES: "ふぉ"
		},
		"u": {
			RES: "ふ"
		},
	},
	"r": {
		RES: "っ",
		"a": {
			RES: "ら"
		},
		"e": {
			RES: "れ"
		},
		"i": {
			RES: "り"
		},
		"o": {
			RES: "ろ"
		},
		"u": {
			RES: "る"
		},
		"y": {
			"a": {
				RES: "りゃ"
			},
			"o": {
				RES: "りょ"
			},
			"u": {
				RES: "りゅ"
			}
		}
	},
	"t": {
		RES: "っ",
		"a": {
			RES: "た"
		},
		"e": {
			RES: "て"
		},
		"i": {
			RES: "ち"
		},
		"o": {
			RES: "と"
		},
		"u": {
			RES: "つ"
		},
		"y": {
			"a": {
				RES: "ちゃ"
			},
			"o": {
				RES: "ちょ"
			},
			"u": {
				RES: "ちゅ"
			}
		}
	},
	"y": {
		RES: "っ",
		"a": {
			RES: "や"
		},
		"o": {
			RES: "よ"
		},
		"u": {
			RES: "ゆ"
		}
	},
	"j": {
		RES: "っ",
		"a": {
			RES: "じゃ"
		},
		"o": {
			RES: "じょ"
		},
		"i": {
			RES: "じ"
		},
		"u": {
			RES: "じゅ"
		}
	},
	"c": {
		RES: "っ",
		"h": {
			"a": {
				RES: "ちゃ"
			},
			"o": {
				RES: "ちょ"
			},
			"i": {
				RES: "ち"
			},
			"u": {
				RES: "ちゅ"
			}
		}
	},
	"p": {
		RES: "っ",
		"a": {
			RES: "ぱ"
		},
		"e": {
			RES: "ぺ"
		},
		"i": {
			RES: "ぴ"
		},
		"o": {
			RES: "ぽ"
		},
		"u": {
			RES: "ぷ"
		},
		"y": {
			"a": {
				RES: "ぴゃ"
			},
			"o": {
				RES: "ぴょ"
			},
			"u": {
				RES: "ぴゅ"
			}
		}
	},
	"s": {
		RES: "っ",
		"h": {
			"a": {
				RES: "しゃ"
			},
			"o": {
				RES: "しょ"
			},
			"i": {
				RES: "し"
			},
			"u": {
				RES: "しゅ"
			}
		},
		"a": {
			RES: "さ"
		},
		"e": {
			RES: "せ"
		},
		"i": {
			RES: "し"
		},
		"o": {
			RES: "そ"
		},
		"u": {
			RES: "す"
		},
		"y": {
			"a": {
				RES: "しゃ"
			},
			"o": {
				RES: "しょ"
			},
			"u": {
				RES: "しゅ"
			}
		}
	},
	"d": {
		RES: "っ",
		"a": {
			RES: "だ"
		},
		"e": {
			RES: "で"
		},
		"i": {
			RES: "ぢ"
		},
		"o": {
			RES: "ど"
		},
		"u": {
			RES: "づ"
		},
		"y": {
			"a": {
				RES: "ぢゃ"
			},
			"o": {
				RES: "ぢょ"
			},
			"u": {
				RES: "ぢゅ"
			}
		}
	},
	"g": {
		RES: "っ",
		"a": {
			RES: "が"
		},
		"e": {
			RES: "げ"
		},
		"i": {
			RES: "ぎ"
		},
		"o": {
			RES: "ご"
		},
		"u": {
			RES: "ぐ"
		},
		"y": {
			"a": {
				RES: "ぎゃ"
			},
			"o": {
				RES: "ぎょ"
			},
			"u": {
				RES: "ぎゅ"
			}
		}
	},
	"h": {
		RES: "っ",
		"a": {
			RES: "は"
		},
		"e": {
			RES: "へ"
		},
		"i": {
			RES: "ひ"
		},
		"o": {
			RES: "ほ"
		},
		"u": {
			RES: "ふ"
		},
		"y": {
			"a": {
				RES: "ひゃ"
			},
			"o": {
				RES: "ひょ"
			},
			"u": {
				RES: "ひゅ"
			}
		}
	},
	"k": {
		RES: "っ",
		"a": {
			RES: "か"
		},
		"e": {
			RES: "け"
		},
		"i": {
			RES: "き"
		},
		"o": {
			RES: "こ"
		},
		"u": {
			RES: "く"
		},
		"y": {
			"a": {
				RES: "きゃ"
			},
			"o": {
				RES: "きょ"
			},
			"u": {
				RES: "きゅ"
			}
		}
	},
	"z": {
		RES: "っ",
		"a": {
			RES: "ざ"
		},
		"e": {
			RES: "ぜ"
		},
		"i": {
			RES: "じ"
		},
		"o": {
			RES: "ぞ"
		},
		"u": {
			RES: "ず"
		},
		"y": {
			"a": {
				RES: "じゃ"
			},
			"o": {
				RES: "じょ"
			},
			"u": {
				RES: "じゅ"
			}
		}
	},
	"b": {
		RES: "っ",
		"a": {
			RES: "ば"
		},
		"e": {
			RES: "べ"
		},
		"i": {
			RES: "び"
		},
		"o": {
			RES: "ぼ"
		},
		"u": {
			RES: "ぶ"
		},
		"y": {
			"a": {
				RES: "びゃ"
			},
			"o": {
				RES: "びょ"
			},
			"u": {
				RES: "びゅ"
			}
		}
	},
	"n": {
		RES: "ん",
		"a": {
			RES: "な"
		},
		"e": {
			RES: "ね"
		},
		"i": {
			RES: "に"
		},
		"o": {
			RES: "の"
		},
		"u": {
			RES: "ぬ"
		},
		"y": {
			"a": {
				RES: "にゃ"
			},
			"o": {
				RES: "にょ"
			},
			"u": {
				RES: "にゅ"
			}
		}
	},
	"m": {
		RES: "っ",
		"a": {
			RES: "ま"
		},
		"e": {
			RES: "め"
		},
		"i": {
			RES: "み"
		},
		"o": {
			RES: "も"
		},
		"u": {
			RES: "む"
		},
		"y": {
			"a": {
				RES: "みゃ"
			},
			"o": {
				RES: "みょ"
			},
			"u": {
				RES: "みゅ"
			}
		}
	}
}